#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.history_slicer_function.data.external.archive_prepare[0]: Reading...
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.vehicle_data_function.data.external.archive_prepare[0]: Reading...
module.charing_history_exporter_function.data.external.archive_prepare[0]: Reading...
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_layer_s3.local_file.archive_plan[0]: Refreshing state... [id=bd3d99270960cad1c7336f0a14ac85e88ee3fdae]
module.vehicle_data_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.charing_history_exporter_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.vehicle_data_function.local_file.archive_plan[0]: Refreshing state... [id=5af4acd8abf371295292a0d4750d6b4c60c7e7cd]
module.history_slicer_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.charing_history_exporter_function.local_file.archive_plan[0]: Refreshing state... [id=4fa2966c4b8f2ddcca52662d61cb3d3ee2a78322]
module.history_slicer_function.local_file.archive_plan[0]: Refreshing state... [id=8b0f25e2036f08de617f38c1f28b9110d52161fe]
module.lambda_layer_s3.null_resource.archive[0]: Refreshing state... [id=5329155390119118089]
module.charing_history_exporter_function.null_resource.archive[0]: Refreshing state... [id=8433597828464640694]
module.vehicle_data_function.null_resource.archive[0]: Refreshing state... [id=6888480950115708197]
module.history_slicer_function.null_resource.archive[0]: Refreshing state... [id=4451314452390726440]
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_region.current: Reading...
module.vehicle_data_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_partition.current: Reading...
module.vehicle_data.aws_dynamodb_table.this[0]: Refreshing state... [id=vehicle-data]
module.s3_bucket.data.aws_partition.current: Reading...
module.vehicle_data_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/vehicle-data]
module.lambda_layer_s3.data.aws_region.current: Reading...
module.vehicle_data_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_caller_identity.current: Reading...
module.vehicle_data_function.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Reading...
aws_s3_bucket.this: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.history_slicer_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/history-slicer]
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.lambda_layer_s3.data.aws_partition.current: Reading...
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=tesla-data-exporter]
module.vehicle_data_function.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
aws_cloudwatch_event_rule.vehicle_data: Refreshing state... [id=tesla-data-exporter20231002185714156700000001]
module.charing_history_exporter_function.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
aws_cloudwatch_event_rule.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.history_slicer_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.charing_history_exporter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tesla-data-exporter]
module.history_slicer_function.data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=tde-slicer]
data.aws_caller_identity.current: Read complete after 1s [id=402889198055]
module.charing_history_exporter_function.data.aws_partition.current: Reading...
module.charing_history_exporter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
aws_ssm_parameter.refresh_token: Refreshing state... [id=/tesla-data-exporter/refresh_token]
aws_ssm_parameter.email: Refreshing state... [id=/tesla-data-exporter/email]
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.vehicle_data_function.aws_iam_role.lambda[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.aws_iam_role.lambda[0]: Refreshing state... [id=tesla-data-exporter]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7eb60e703ce476dda79c3026f9e3373dcf661ed201b4d53471100e2f29a9e43d]
module.history_slicer_function.aws_iam_role.lambda[0]: Refreshing state... [id=history-slicer]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Reading...
data.aws_iam_policy_document.vehicle_data: Reading...
data.aws_iam_policy_document.vehicle_data: Read complete after 0s [id=1837894490]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4225016675]
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=290343876]
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Reading...
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4275475925]
module.vehicle_data_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/vehicle-data-logs]
module.charing_history_exporter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/tesla-data-exporter-logs]
module.history_slicer_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/history-slicer-logs]
module.vehicle_data_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=vehicle-data-20231001174846802700000003]
module.charing_history_exporter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tesla-data-exporter-20231001175840578300000002]
module.history_slicer_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=history-slicer-20231001174846812600000004]
data.aws_iam_policy_document.history_slicer: Reading...
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.history_exporter: Reading...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.history_slicer: Read complete after 0s [id=3487884030]
data.aws_iam_policy_document.history_exporter: Read complete after 0s [id=3850528508]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=tesla-data-exporter]
module.lambda_layer_s3.aws_s3_object.lambda_package[0]: Refreshing state... [id=lambda-builds/c346be1afd878996fa52fd75b5e56802c937c955dad32184532bd51a149f7c65.zip]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=tesla-data-exporter,private]
module.lambda_layer_s3.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:4]
module.history_slicer_function.aws_lambda_function.this[0]: Refreshing state... [id=history-slicer]
module.vehicle_data_function.aws_lambda_function.this[0]: Refreshing state... [id=vehicle-data]
module.charing_history_exporter_function.aws_lambda_function.this[0]: Refreshing state... [id=tesla-data-exporter]
module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"]: Refreshing state... [id=s3]
module.history_slicer_function.aws_lambda_permission.unqualified_alias_triggers["s3"]: Refreshing state... [id=s3]
aws_s3_bucket_notification.slicer: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
module.vehicle_data_function.aws_lambda_permission.current_version_triggers["AtMidnight"]: Refreshing state... [id=AtMidnight]
module.vehicle_data_function.aws_lambda_permission.unqualified_alias_triggers["AtMidnight"]: Refreshing state... [id=AtMidnight]
module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
module.charing_history_exporter_function.aws_lambda_permission.unqualified_alias_triggers["EveryEightHours"]: Refreshing state... [id=EveryEightHours]
aws_cloudwatch_event_target.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001-terraform-20231001175918661000000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.charing_history_exporter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tesla-data-exporter"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:4",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:tesla-data-exporter:4/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "EveryEightHours" -> (known after apply)
      ~ qualifier           = "4" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.charing_history_exporter_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8433597828464640694" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696279201591515000" -> "1696279419591747000"
            # (1 unchanged element hidden)
        }
    }

  # module.history_slicer_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "history-slicer"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:4",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:history-slicer:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:history-slicer:4/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "s3" -> (known after apply)
      ~ qualifier           = "4" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.history_slicer_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4451314452390726440" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696279201600534000" -> "1696279419615421000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:4" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-10-02T20:40:20.733+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies" -> (known after apply)
      ~ s3_key                      = "lambda-builds/c346be1afd878996fa52fd75b5e56802c937c955dad32184532bd51a149f7c65.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      ~ s3_object_version           = "9EGBSUfptQNOLDtn8eZMDvnFREyy9Emj" # forces replacement -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Wf1o4yRmK6Ky4YxCWDtuk8IrPYvKuf760mRBQwJ44lA=" -> (known after apply)
      ~ source_code_size            = 14503837 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "759592f715a2640ce09616c49361e37b-3" -> (known after apply)
      ~ id                     = "lambda-builds/c346be1afd878996fa52fd75b5e56802c937c955dad32184532bd51a149f7c65.zip" -> (known after apply)
      ~ key                    = "lambda-builds/c346be1afd878996fa52fd75b5e56802c937c955dad32184532bd51a149f7c65.zip" -> "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "./.terraform/lambda_builds/c346be1afd878996fa52fd75b5e56802c937c955dad32184532bd51a149f7c65.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      - tags                   = {} -> null
      ~ version_id             = "9EGBSUfptQNOLDtn8eZMDvnFREyy9Emj" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "./.terraform/lambda_builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "../lambda/packages",
                      + null,
                    ],
                ]
              + filename      = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5329155390119118089" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "./.terraform/lambda_builds/c346be1afd878996fa52fd75b5e56802c937c955dad32184532bd51a149f7c65.zip" -> "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
          ~ "timestamp" = "1696279202100863000" -> "1696279419568240000"
        }
    }

  # module.vehicle_data_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "vehicle-data"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-1:402889198055:layer:tesla-data-exporter-dependencies:4",
        ] -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:402889198055:function:vehicle-data:4/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vehicle_data_function.aws_lambda_permission.current_version_triggers["AtMidnight"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "AtMidnight" -> (known after apply)
      ~ qualifier           = "4" # forces replacement -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vehicle_data_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6888480950115708197" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696279201592869000" -> "1696279419555107200"
            # (1 unchanged element hidden)
        }
    }

Plan: 10 to add, 3 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*